cask_args appdir: '/Applications'

tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/homebrew-php'

brew 'ack'
brew 'awscli'
brew 'bash-completion'
brew 'bitlbee'
brew 'coreutils'
brew 'ctags-exuberant'
brew 'curl'
brew 'gist'
brew 'git'
brew 'go'
brew 'jq'
brew 'libtool'
brew 'lzo'
brew 'macvim', args: ['HEAD', 'with-lua', 'with-luajit', 'with-override-system-vim']
brew 'mysql'
brew 'node'
brew 'pam_yubico'
brew 'pre-commit'
brew 'php70-intl'
brew 'php70-mcrypt'
brew 'php70-opcache'
brew 'php70-xdebug'
brew 'php71'
brew 'php71-intl'
brew 'php71-mcrypt'
brew 'php71-opcache'
brew 'php71-xdebug'
brew 'python3'
brew 'openssl'
brew 'rabbitmq'
brew 'readline'
brew 'redis'
brew 'terminal-notifier'
brew 'testdisk'
brew 'wget'
brew 'xz'
brew 'yarn'
brew 'zsh'

cask 'atom'
cask 'caffeine'
cask 'cyberduck'
cask 'firefox'
cask 'gitter'
cask 'google-chrome'
cask 'google-drive-file-stream'
cask 'iterm2'
cask 'istat-menus'
cask 'kaleidoscope'
#cask 'kindle'
cask 'lastpass'
cask 'mysqlworkbench'
cask 'oversight'
cask 'paw'
cask 'postman'
cask 'sequel-pro'
cask 'sourcetree'
cask 'spectacle'
cask 'spotify'
cask 'slack'
cask 'textmate'
cask 'vagrant'
cask 'virtualbox'
cask 'visual-studio-code'
#cask 'visual-studio-code-insiders'
cask '1password'


# app store
mas 'microsoft-onenote', id: 784801555
mas 'microsoft-remote-desktop', id: 715768417
mas 'onedrive', id: 823766827
# mas 'xcode', id: 497799835
mas 'wunderlist-to-do-list-tasks', id: 410628904


# fonts
cask 'caskroom/fonts/font-hack'
