cask_args appdir: '/Applications'

tap 'dapr/tap'
tap 'derailed/k9s'
tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'

brew 'ack'
brew 'awscli'
brew 'bash-completion'
brew 'bat'
brew 'composer'
brew 'coreutils'
brew 'ctags-exuberant'
brew 'curl'
brew 'dapr/tap/dapr-cli'
brew 'derailed/k9s/k9s'
brew 'diff-so-fancy'
brew 'gist'
brew 'git'
brew 'glab'
brew 'go'
brew 'java'
brew 'jq'
brew 'kubectl'
brew 'kubectx'
brew 'krew'
brew 'helm'
brew 'helmfile'
brew 'libtool'
brew 'macvim'
brew 'mdcat'
brew 'mysql@5.7'
brew 'node'
brew 'pre-commit'
brew 'python3'
brew 'cairo'
brew 'pango'
brew 'openssl'
brew 'readline'
brew 'redis'
brew 'rtx'
brew 'sqlite'
brew 'terraform'
brew 'tldr'
brew 'tree'
brew 'vault'
brew 'wget'
brew 'zlib'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'

cask '1password'
cask 'aptakube'
cask 'cron'
cask 'cyberduck'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'google-drive'
cask 'iterm2'
cask 'kaleidoscope'
cask 'lastpass'
cask 'mysqlworkbench'
cask 'notion'
cask 'paw'
cask 'postman'
cask 'sequel-pro'
cask 'spotify'
cask 'slack'
cask 'textmate'
cask 'tunnelblick'
cask 'vagrant'
cask 'visual-studio-code'
cask 'zoom'


# app store
mas 'amphetamine', id: 937984704
mas 'onedrive', id: 823766827

# fonts
cask 'font-hack'
cask 'font-fira-code'
