cask_args appdir: '/Applications'

tap 'dapr/tap'
tap 'derailed/k9s'
tap 'hashicorp/tap'


brew 'ack'
brew 'awscli'
brew 'bash-completion'
brew 'bat'
brew 'composer'
brew 'coreutils'
brew 'ctags-exuberant'
brew 'curl'
brew 'dapr/tap/dapr-cli'
brew 'derailed/k9s/k9s'
brew 'diff-so-fancy'
brew 'figlet'
brew 'gist'
brew 'git'
brew 'glab'
brew 'glow'
brew 'go'
brew 'hashicorp/tap/terraform'
brew 'hashicorp/tap/vault'
brew 'helm'
brew 'helmfile'
brew 'jq'
brew 'kubectl'
brew 'kubectx'
brew 'krew'
brew 'mise'
brew 'libtool'
brew 'lolcat'
brew 'macvim'
brew 'mysql'
brew 'node'
brew 'pre-commit'
brew 'python3'
brew 'cairo'
brew 'pango'
brew 'openssl'
brew 'readline'
brew 'redis'
brew 'sqlite'
brew 'tlrc'
brew 'tree'
brew 'wget'
brew 'zlib'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'

cask '1password'
cask 'aptakube'
cask 'boop'
cask 'notion-calendar'
cask 'cursor'
cask 'cyberduck'
cask 'docker-desktop'
cask 'firefox'
cask 'gcloud-cli'
cask 'google-chrome'
cask 'google-drive'
cask 'iterm2'
cask 'kaleidoscope'
cask 'lastpass'
cask 'logi-options+' # alternatives: bettermouse or offline version of options+
cask 'mysqlworkbench'
cask 'notion'
cask 'postman'
cask 'rapidapi'
cask 'sequel-pro'
cask 'spotify'
cask 'slack'
cask 'textmate'
cask 'tunnelblick'
cask 'vagrant'
cask 'visual-studio-code'
cask 'zoom'


# app store
mas 'amphetamine', id: 937984704
mas 'onedrive', id: 823766827

# fonts
cask 'font-fira-code'
